GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_timers.c

//*******1*********2*********3*********4*********5*********6*********7**********
//
//                           board_STM32_timers.c
//
//
//  Common Logic for Timer and PWM support for STM32 MCUs.
//
//  Uses a combination of HAL_Library (mostly for configuration) and direct
//  register calls (main execution).
//
//  Specific chip dependences are mainly constrained to tables (GPIOs used
//  specific TIMx modules supported, etc). They are pulled in as #includes
//  based on MCU type.
//
//  In general, the use of #ifdefs within the code has been minimized, in
//  order to keep things read-able and maintainable.
//
//  History:
//    12/30/14 - Created for Industrial IoT OpenSource project.  Duq
//    04/30/15 - Added multi-channel PWM support.  WORKS.   Duq
//    07/03/15 - Merge in changes for Timer / PWM enhancements. Duq
//    07/16/15 - Reworked to provide better factoring. Duq
// -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -
//
// The MIT License (MIT)
//
// Copyright (c) 2014-2015 Wayne Duquaine / Grandview Systems
//
// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:
// 
// The above copyright notice and this permission notice shall be included in
// all copies or substantial portions of the Software.
// 
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
// THE SOFTWARE.
//*****************************************************************************

//*****************************************************************************
//*****************************************************************************
//               REAL  TIMER / PWM   Support           Physical Timers on chip
//*****************************************************************************
//*****************************************************************************
#include "user_api.h"                // pull in defs for User API calls

long  board_timerpwm_compute_prescalar (long period_val);    // Function protos
int   board_timerpwm_enable_clock (int module_id);
int   board_timerpwm_channel_lookup (int chan_id, int *chan_index);
int   board_timerpwm_config_gpios (void *pwmblkp, int chan_id);

    unsigned long   tim3_TIM_rupts_seen = 0;

     //-------------------------------------------------------------------------
     // Global Variables needed to ensure consistency for ADC and DAC triggering
     //-------------------------------------------------------------------------
  extern uint16_t   _g_trigger_auser_api_id;   // User API id for the trigger
  extern uint16_t   _g_trigger_atmr_mmsmask;   // Associated Mask for TIM's  MMS
  extern uint16_t   _g_trigger_dtmr_mmsmask_1; // Chan 1 Associated Mask for TIM's  MMS
  extern uint16_t   _g_trigger_duser_api_id_1; //   "    Associated DAC trigger type
  extern uint16_t   _g_trigger_dtmr_mmsmask_2; // Chan 2 Associated Mask for TIM's  MMS
  extern uint16_t   _g_trigger_duser_api_id_2; //   "    Associated DAC trigger type


     //------------------------------------------------------------------------
     //
     // Pull in        MCU dependent GPIO / TIM tables and #defines
     //
     // The top of each module include key defines for:
     //          MAX_TIMERS,
     //          TMRPWM_NUM_MODULES
     //          TMRPWM_MAX_CHANNELS
     //
     // The following tables are pulled in:
     //          _g_timer_module_base[]       table/array
     //          _g_TIMx_TimPwmHandle's
     //          _g_timer_typedef_handle[]    table/array       was _g_timer_module_handle
     //          _g_TMPWM_IRQ_table[]         table/array
     //          _g_timer_base_channel_num[]  table/array
     //          _g_tmrpwm_mod_x_channels []  set of tables/arrays for GPIOs
     //          _g_tmrpwm_mod_channel_blk_lookup []    table/array
     //
     // Also, the following two utility routines are included in those files:
     //        - board_timerpwm_compute_prescalar()  because that is MCU speed
     //                                              and clock specific
     //        - board_timerpwm_enable_clock()       because which Timers are
     //                                              supported and the logic to
     //                                              start them is MCU specific
     //------------------------------------------------------------------------

#if defined(__STM32F072__) || defined(STM32F072xB)
//                                         STM32 - F072  Nucleo
#include "STM32_F0/board_F0_tables_timer.c"
#define  HAS_TIM1
#define  HAS_TIM2
#define  HAS_TIM3
#define  HAS_TIM6
#define  HAS_TIM7
#define  HAS_TIM14
#define  HAS_TIM15
#define  HAS_TIM16
#define  HAS_TIM17
#endif


#if defined(__STM32F091__) || defined(STM32F091xC)
//                                         STM32 - F091  Nucleo
#include "STM32_F0/board_tables_F0_timer.c"
#define  HAS_TIM1
#define  HAS_TIM2
#define  HAS_TIM3
#define  HAS_TIM6
#define  HAS_TIM7
#define  HAS_TIM14
#define  HAS_TIM15
#define  HAS_TIM16
#define  HAS_TIM17
#endif


#if defined(__STM32F103__) || defined(STM32F103xB)
//                                         STM32 - F103  Nucleo
#include "STM32_F1/board_F1_tables_timer.c"
#endif


#if defined(STM32F303xE)
//                                         STM32 - F303  Nucleo
#include "STM32_F3/board_F303_tables_timer.c"
#define  HAS_TIM1
#define  HAS_TIM2
#define  HAS_TIM3
#define  HAS_TIM4
#define  HAS_TIM6
#define  HAS_TIM7
#define  HAS_TIM8
#define  HAS_TIM15
#define  HAS_TIM16
#define  HAS_TIM17
#define  HAS_TIM20
#endif


