GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_timers.c
#if defined(STM32F334x8)
//                                         STM32 - F334  Nucleo
#include "STM32_F3/board_F334_tables_timer.c"
#define  HAS_TIM1
#define  HAS_TIM2
#define  HAS_TIM3
#define  HAS_TIM6
#define  HAS_TIM7
#define  HAS_TIM15
#define  HAS_TIM16
#define  HAS_TIM17
#endif


#if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F411xE)
//                                         STM32 - F401/F411  Nucleos
#include "STM32_F4/board_F4x1_tables_timer.c"
#define  HAS_TIM1
#define  HAS_TIM2
#define  HAS_TIM3
#define  HAS_TIM4
#define  HAS_TIM5
#define  HAS_TIM10
#define  HAS_TIM11
#endif

#if defined(STM32F446xx)
//                                         STM32 - F446  Nucleo
#include "STM32_F4/board_F446_tables_timer.c"
#define  HAS_TIM1
#define  HAS_TIM2
#define  HAS_TIM3
#define  HAS_TIM4
#define  HAS_TIM5
#define  HAS_TIM6
#define  HAS_TIM7
#define  HAS_TIM8
#define  HAS_TIM9
#define  HAS_TIM10
#define  HAS_TIM11
#define  HAS_TIM12
#define  HAS_TIM13
#define  HAS_TIM14
#endif


#if defined(STM32F746xx) || defined(STM32F746NGHx)
//                                         STM32 - F746  Discovery
#include "STM32_F7/board_F7_tables_timer.c"
#define  HAS_TIM1
#define  HAS_TIM2
#define  HAS_TIM3
#define  HAS_TIM4
#define  HAS_TIM5
#define  HAS_TIM6
#define  HAS_TIM7
#define  HAS_TIM8
#define  HAS_TIM9
#define  HAS_TIM10
#define  HAS_TIM11
#define  HAS_TIM12
#define  HAS_TIM13
#define  HAS_TIM14
#endif


#if defined(STM32L053xx)
//                                         STM32 - L053  Nucleo
#include "STM32_L0/board_L0_tables_timer.c"
#define  HAS_TIM2
#define  HAS_TIM6
#define  HAS_TIM21
#define  HAS_TIM22
#endif


#if defined(STM32L152xE) || defined(STM32L152xC)
//                                         STM32 - L152  Nucleo
#include "STM32_L1/board_L1_tables_timer.c"
#define  HAS_TIM2
#define  HAS_TIM3
#define  HAS_TIM4
#define  HAS_TIM5
#define  HAS_TIM6
#define  HAS_TIM7
#define  HAS_TIM9
#define  HAS_TIM10
#define  HAS_TIM11
#endif


#if defined(STM32L476xx)
//                                         STM32 - L476  Discovery/Nucleo
#include "STM32_L4/board_L4_tables_timer.c"
#define  HAS_TIM1
#define  HAS_TIM2
#define  HAS_TIM3
#define  HAS_TIM4
#define  HAS_TIM5
#define  HAS_TIM6
#define  HAS_TIM7
#define  HAS_TIM8
#define  HAS_TIM15
#define  HAS_TIM16
#define  HAS_TIM17
#endif


//*****************************************************************************
//*****************************************************************************
//                      COMMON   TABLES and DEFINEs
//
//                                for
//
//                       PWM   and   OC/IC   Timers
//*****************************************************************************
//*****************************************************************************

              // flags for _g_pwm_module_status[] entries
#define  TMR_PWM_NORMAL_INIT      0x01  /* Module setup for normal output mode*/
#define  TMR_PWM_COMPLEMENT_INIT  0x08  /* Module setup for Complementary mode*/
#define  TMR_PWM_INTERRUPTS_USED  0x40  /* Module uses Timer interrupts */

              // flags for _g_tmpwm_channels_config[] entries
              //       and _g_tmpwm_channels_pwm[]
#define  TMR_CCR3N_CONFIGURED     0x80        /* Comple channel 3N configured */
#define  TMR_CCR2N_CONFIGURED     0x40        /* Chan 6 or Comple channel 2N configured */
#define  TMR_CCR1N_CONFIGURED     0x20        /* Chan 5 or Comple channel 1N configured */
#define  TMR_CCR4_CONFIGURED      0x10        /* Channel 4 configured for use */
#define  TMR_CCR3_CONFIGURED      0x08        /* Channel 3 configured for use */
#define  TMR_CCR2_CONFIGURED      0x04        /* Channel 2 configured for use */
#define  TMR_CCR1_CONFIGURED      0x02        /* Channel 1 configured for use */
#define  TMR_CCR0_CONFIGURED      0x01        /* Channel 0 configured for use */

#define   TIMER_IRQ_STARTED       0x01        /* Timer/PWM module IRQ setup, and Started */

                           //--------------------------------------------------------
                           // TIM_HandleTypeDef struct that is used at run-time.
                           // can be a combination of pre-defined
                           // _g_TIMxx_TimPwmHandle from board_XX_timer_tables.c
                           // and User App supplied TIM_HandleTypeDefs (Advanced)
                           //--------------------------------------------------------
    TIM_HandleTypeDef  *_g_timer_runtime_TIM_handle [MAX_TIMER+1] = { 0,0,0,0,0,0 };

                           //--------------------------------------------------------
                           // Bit mask status of each Timer Module (initialized, ...)
                           //--------------------------------------------------------
    char              _g_tmpwm_module_status [MAX_TIMER+1] = { 0,0,0,0,0,0 };

                           //--------------------------------------------------------
                           // Started status of each Timer Module (IRQ setup, Start issued)
                           //--------------------------------------------------------
    char              _g_timer_enable_status [MAX_TIMER+1] = { 0,0,0,0,0,0 };

                           //--------------------------------------------------------
                           // Bit Mask status of CCRs in each module (enabled, PWM, ...)
                           // One entry per timer module.
                           //--------------------------------------------------------
    unsigned char     _g_tmpwm_channels_config [MAX_TIMER+1] = { 0,0,0,0,0,0,0,0 };


                           //--------------------------------------------------------
                           // Bit Mask PWM status of CCRs in each module (Normal, Complementary,...)
                           // One entry per timer module.
                           //--------------------------------------------------------
    unsigned char     _g_tmpwm_channels_pwm [MAX_TIMER+1] = { 0,0,0,0,0 };


                           //--------------------------------------------------------
                           // Bit mask of which CCRs are using interrupts in each module.
                           // One entry per timer module.
                           //--------------------------------------------------------
    uint16_t          _g_timer_app_enabled_interrupts [MAX_TIMER+1] = { 0,0,0,0,0,0 };


                           //--------------------------------------------------------
                           // Interrupt Callback addresses. One entry per timer module.
                           //--------------------------------------------------------
TMR_CB_EVENT_HANDLER  _g_ptimer_callback [MAX_TIMER+1] = { 0,0,0,0,0,0,0,0,0,0 };
    void              *_g_ptimer_callback_parm [MAX_TIMER+1];

                           //--------------------------------------------------------
                           // Timer Prescalars used for each Timer module.
                           //--------------------------------------------------------
    uint32_t          _g_tmpwm_prescalars [MAX_TIMER+1]    = { 0,0,0,0,0,0 };


        //----------------------------------------------------------------------
        //     Global constants and Tables used to manage Timer/PWM Logic
        //----------------------------------------------------------------------
const unsigned char    _g_pwm_chan_mask [8]     // Bit masks used to track if a channel
                                                // is enabled and/or using COMPLE
                                  = {      0,         /* Channel 0 is unused */
                                      TMR_CCR1_CONFIGURED,  /* Channels 1-4 */
                                      TMR_CCR2_CONFIGURED,  /*   0x02  */
                                      TMR_CCR3_CONFIGURED,  /*   0x04  */
                                      TMR_CCR4_CONFIGURED,  /*   0x08  */
                                      TMR_CCR1N_CONFIGURED, /* Channels 1N-3N */
                                      TMR_CCR2N_CONFIGURED, /*   0x20  */
                                      TMR_CCR3N_CONFIGURED  /*   0x40  */
                                    };                      // there is no 4N

                           //-------------------------------------------------------
                           // List of HAL constants to specify interrupt mask for a CCR
                           //-------------------------------------------------------
const unsigned char   _g_tmpwm_CCR_rupt_flags [5]
                                  = { TIM_SR_UIF,        /* CCR0 aka Rollover */
                                      TIM_SR_CC1IF,      /* CCR1 interrupt    */
                                      TIM_SR_CC2IF,      /* CCR2 interrupt    */
                                      TIM_SR_CC3IF,      /* CCR3 interrupt    */
                                      TIM_SR_CC4IF       /* CCR4 interrupt    */
                                    };

                           //-------------------------------------------------------
                           // List of constants used by HAL to identify CCR channels
                           //-------------------------------------------------------
const unsigned int    _g_timer_channel_id [5]
                                   = { 0,       // unused
                                       TIM_CHANNEL_1,       /* 0x0000 */
                                       TIM_CHANNEL_2,       /* 0x0004 */
                                       TIM_CHANNEL_3,       /* 0x0008 */
                                       TIM_CHANNEL_4        /* 0x000C */
                                     };


                             //-------------------------------------------------
                             // _g_timer_base_channel_num
                             //
                             //     converts user API logical channel numbers, such as
                             //     TIMER_CHANNEL_1  / TIMER_CHANNEL_1_ALT1 / TIMER_CHANNEL_1_N
                             //     which are used to denote which Pin-Mux setting to
                             //     use for outputs that can be routed to different pins.
                             //
                             //     The _ALT1 / _ALT2 / _N / _N_ALT settings are
                             //     used to select the proper GPIO onto which to
                             //     route the signal.
                             //-------------------------------------------------
const unsigned char    _g_timer_base_channel_num []
                            = {   -1,               //  0 is not valid
                                TIM_CHANNEL_1,      //  1 TIMER_CHANNEL_1
                                TIM_CHANNEL_2,      //  2 TIMER_CHANNEL_2
                                TIM_CHANNEL_3,      //  3 TIMER_CHANNEL_3
                                TIM_CHANNEL_4,      //  4 TIMER_CHANNEL_4
                                  -1,               //  5 unused
                                  -1,               //  6 unused
                                  -1,               //  7 unused
                                TIM_CHANNEL_1,      //  8 TIMER_CHANNEL_1_ALT1
                                TIM_CHANNEL_2,      //  9 TIMER_CHANNEL_2_ALT1
                                TIM_CHANNEL_3,      // 10 TIMER_CHANNEL_3_ALT1
                                TIM_CHANNEL_4,      // 11 TIMER_CHANNEL_4_ALT1
                                TIM_CHANNEL_1,      // 12 TIMER_CHANNEL_1_ALT2
                                TIM_CHANNEL_2,      // 13 TIMER_CHANNEL_2_ALT2
                                TIM_CHANNEL_3,      // 14 TIMER_CHANNEL_3_ALT2
                                TIM_CHANNEL_4,      // 15 TIMER_CHANNEL_4_ALT2
                                TIM_CHANNEL_1,      // 16 TIMER_CHANNEL_1_N
                                TIM_CHANNEL_2,      // 17 TIMER_CHANNEL_2_N
                                TIM_CHANNEL_3,      // 18 TIMER_CHANNEL_3_N
                                  -1,               // 19 unused (no Channel 4N)
                                TIM_CHANNEL_1,      // 20 TIMER_CHANNEL_1_N_ALT1
                                TIM_CHANNEL_2,      // 21 TIMER_CHANNEL_2_N_ALT1
                                TIM_CHANNEL_3,      // 22 TIMER_CHANNEL_3_N_ALT1
                                  -1,               // 23 unused (no Channel 4N)
                                TIM_CHANNEL_1,      // 24 TIMER_CHANNEL_1_N_ALT2
                                TIM_CHANNEL_2,      // 25 TIMER_CHANNEL_2_N_ALT2
                                TIM_CHANNEL_3,      // 26 TIMER_CHANNEL_3_N_ALT2
                                TIM_CHANNEL_1,      // 27 TIMER_CHANNEL_1_N_ALT3
                                TIM_CHANNEL_2,      // 28 TIMER_CHANNEL_2_N_ALT3
                                TIM_CHANNEL_3,      // 29 TIMER_CHANNEL_3_N_ALT3
                                TIM_CHANNEL_1,      // 30 TIMER_CHANNEL_1_N_ALT4
                                TIM_CHANNEL_2,      // 31 TIMER_CHANNEL_2_N_ALT4

                                TIM_CHANNEL_1,      // 32 TIMER_CHANNEL_1_ALT3
                                TIM_CHANNEL_2,      // 33 TIMER_CHANNEL_2_ALT3
                                TIM_CHANNEL_3,      // 34 TIMER_CHANNEL_3_ALT3
                                TIM_CHANNEL_4,      // 35 TIMER_CHANNEL_4_ALT3
                                TIM_CHANNEL_1,      // 36 TIMER_CHANNEL_1_ALT4
                                TIM_CHANNEL_2,      // 37 TIMER_CHANNEL_2_ALT4
                                TIM_CHANNEL_3,      // 38 TIMER_CHANNEL_3_ALT4
                                TIM_CHANNEL_4,      // 39 TIMER_CHANNEL_4_ALT4
                              };


//*****************************************************************************
//*****************************************************************************
//                    COMMON   TIMER  and  PWM   Code
//
//                                for
//
//                       PWM   and   OC/IC   Timers
//*****************************************************************************
//*****************************************************************************

//*****************************************************************************
//*****************************************************************************
//            COMMON  Utility  Routines   between   TIMERs  and  PWMs
//*****************************************************************************
//*****************************************************************************

