GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_timers.c
//******************************************************************************
//  board_timerpwm_channel_lookup
//
//           Converts an extended channel id: ALT1 / ALT2 / _N / N_ALT1 / N_ALT2
//           into the associated base channel number needed by the HAL_TIM_OC_xx
//           calls.
//
//           returned hal_channel_num is a bit encoded pattern (0x0000 - 0x000C)
//           used by the various HAL_TIM_OC_xx() and HAL_TIM_PWM_xx() calls
//
//           chan_index is a linear index 1 to 4, that is returned for any
//           operations that required straight indxed table lookups for
//           the base underlying channel.
//******************************************************************************
int  board_timerpwm_channel_lookup (int chan_id, int *chan_index)
{
    int  hal_channel_num;

    if (chan_id < TIMER_CHANNEL_1 || chan_id  > TIMER_CHANNEL_3_N_ALT2)
       return (-1);                         // chan id is outside of valid range

    hal_channel_num = (int) _g_timer_base_channel_num [chan_id];

    *chan_index = (hal_channel_num >> 2) + 1;    // yields index of 1 - 4
    return (hal_channel_num);
}


//******************************************************************************
//  board_timerpwm_config_gpios
//
//            Configure the GPIO for Timer PWM, Output Compare, or Input Capture
//            by setting up associated ALTERNATE FUNCTION bits for Pin Muxing.
//
//            Also, if an ALT1/ALT2 channel id is requested, scan through the
//            table to find the matching entry.
//******************************************************************************
int  board_timerpwm_config_gpios (void *pwmblkp, int chan_id)
{
    GPIO_InitTypeDef    GPIO_InitStruct;
    TMPWM_CHANNEL_BLK   *tmrblkp;
    uint8_t             user_chan_id;

    user_chan_id = (uint8_t) chan_id;             // co-erce to correct datatype
    tmrblkp = (TMPWM_CHANNEL_BLK*) pwmblkp;
    if (tmrblkp->user_channel_id != user_chan_id)
       {     // scan across the table looking for a matching ALT channel id
         while (tmrblkp->user_channel_id != user_chan_id)
           {
             if (tmrblkp->user_channel_id == user_chan_id)
                break;                                       // we found a match
             tmrblkp++;                           // step to next entry in table
             if (tmrblkp->user_channel_id == 0)
                return (ERR_PWM_CHANNEL_NUM_NOT_SUPPORTED);  // hit end of list
           }
       }

    memset (&GPIO_InitStruct, 0, sizeof(GPIO_InitStruct));   // clear struct

    GPIO_InitStruct.Pin       = tmrblkp->chan_gpio_pin;

// ??? !!! need to specify INPUT if for INPUT CAPTURE  !!! ???
//                             vvvvvvvvvvvvvvvvvvv
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_PULLUP;
    GPIO_InitStruct.Speed     = GPIO_SPEED_HIGH;
    GPIO_InitStruct.Alternate = tmrblkp->chan_alt_func;  // set Pin Mux Alt Function code
    HAL_GPIO_Init (tmrblkp->chan_gpio_port, &GPIO_InitStruct);

// ??? in future,  do  pchanConfig. stuff as well ???

    return (0);
}



//*****************************************************************************
//  board_timerpwm_init
//
//         Initializes a Timer/PWM with correct mode, and initial period.
//
// parms:
//     Counter Type:  up/down/center-aligned, single shot. Valid values:
//        - TIMER_COUNT_UP
//        - TIMER_COUNT_DOWN
//        - TIMER_COUNT_UPDOWN
//        - TIMER_ONE_SHOT_COUNT_UP
//        - TIMER_ONE_SHOT_COUNT_DOWN
//
//     timer_clock_source:
//        -
//
//     Flags:  interrupts used, auto-prescale. Valid values:
//        - TIMER_AUTO_PRESCALE    automaticall calculate PSC value and pre-scale values
//        - PWM_COMPLEMENTARY_OUTPUTS
//
//     aller_htim_ptr:  caller supplied TIM_TypeDef
//        - if non-zero, caller has special processing requests, so is passing
//          in his own pre-setup TIM_Handle and Init structiure
//
//  NOTE:
//         HAL code analysis shows that there is almost no difference between
//         the HAL_TIM_OC_Init(), HAL_TIM_PWM_Init, and HAL_TIM_Base_Init().
//         The only difference is their invocations of differnt MspInit()
//         callbacks, which we do not use.
//
//         So except where there is a substantive code difference (mainly on
//         Config Channels), we utilize the HAL_TIM_OC_xx or HAL_TIM_Base_xx
//         to avoid importing redundant amounts of bloatware. Hence we avoid
//         using the (mostly redundant) HAL_TIM_PWM_xx calls except on Config Channels.
//*****************************************************************************
int  board_timerpwm_init (unsigned int module_id, int counter_type, long period_value,
                          int timer_clock_source, int flags,
                          TIM_HandleTypeDef *caller_htim_ptr) // extended support

{
    TIM_TypeDef         *timbase;
    TIM_HandleTypeDef   *hdltimer;
    uint32_t            counter_mode;
    long                prescalar_val;
    int                 rc;

    if (module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

      // based on module_id, setup pointer to associated timer objects
    if (caller_htim_ptr != 0L)
       {   // caller wants to use _his_ SPI_TypeDef handle, not our internal one
         hdltimer = caller_htim_ptr;              // Use caller's TIM_HandelDef
       }
      else {    // use our internal TypeDef Handle for all calls
             hdltimer = (TIM_HandleTypeDef*) _g_timer_typedef_handle [module_id];
             if (hdltimer == 0L)
                return (ERR_TIMER_NUM_NOT_SUPPORTED);
           }
    memset (hdltimer, 0, sizeof(TIM_HandleTypeDef));   // clear struct

         // Save the TIM TypeDef handle to use during all runtime I/O processing
    _g_timer_runtime_TIM_handle [module_id]= hdltimer;

            // get ptr to associated TIM register
    timbase  = (TIM_TypeDef*) _g_timer_module_base [module_id];
    if (timbase == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

    if (counter_type == TIMER_COUNT_UP)
       counter_mode = TIM_COUNTERMODE_UP;
       else if (counter_type == TIMER_COUNT_DOWN)
               counter_mode = TIM_COUNTERMODE_DOWN;
       else if (counter_type == TIMER_COUNT_UPDOWN)
               counter_mode = TIM_COUNTERMODE_CENTERALIGNED3;
       else if (counter_type == TIMER_ONE_SHOT_COUNT_UP)
               counter_mode = TIM_COUNTERMODE_UP;
       else if (counter_type == TIMER_ONE_SHOT_COUNT_DOWN)
               counter_mode = TIM_COUNTERMODE_DOWN;
       else if (counter_type == TIMER_INPUT_CAPTURE)
               ;
       else return (ERR_TIMER_INVALID_COUNTER_TYPE);

      //----------------------------------------------------------
      // If Timer was already initialized - ignore the second call
      //-----------------------------------------------------------
   if (_g_tmpwm_module_status [module_id] != 0)
      return (WARN_TIMER_WAS_ALREADY_INITIALIZED);

      //--------------------------------------------------------
      // Turn on clock for the associated TIMx module.
      //--------------------------------------------------------
    board_timerpwm_enable_clock (module_id);    // ensure Timer clock is turn on

    prescalar_val = 0;
#if (SCREWING_UP_DAC_TIMERS_BIG_TIME) // 06/26/15 - makes length of Sine/Triangle hugely long (seconds duration for 1 cycle)
#endif
    if (flags & TIMER_AUTO_PRESCALE)
       {
              //---------------------------------------------------------------------
              //                     perform   AUTO-PRE-SCALING
              // Compute any needed prescaler value to fit 16-bit TIMx counter clock.
              // Also adjust period_value to reflect effect of pre-scalar.
              //---------------------------------------------------------------------
         prescalar_val = board_timerpwm_compute_prescalar (period_value);
         if (prescalar_val > 0)
            period_value = (period_value / prescalar_val);
         _g_tmpwm_prescalars[module_id] = prescalar_val;  // save PRE-SCALAR for duty cycle calcs
       }

