GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_timers.c
              //---------------------------------------------------------------------
              // Call HAL logic to configure the TIM module for usage.
              //---------------------------------------------------------------------
    if (counter_type >= TIMER_COUNT_UP && counter_type <= TIMER_ONE_SHOT_COUNT_DOWN)
       {    // Configure the TIMx peripheral for Timer Output
         hdltimer->Instance               = timbase;
         hdltimer->Init.Period            = (period_value - 1); // set # ticks needed for that frequency
         hdltimer->Init.Prescaler         = prescalar_val;
         hdltimer->Init.ClockDivision     = 0;
         hdltimer->Init.CounterMode       = counter_mode;
#if defined(STM32L053xx) || defined(STM32L152xE)
               // L0 / L1 do not support RepetitionCounter
#else
         hdltimer->Init.RepetitionCounter = 0;
#endif
         rc = HAL_TIM_Base_Init (hdltimer);
       }
      else
       {    // Configure the TIMx peripheral for Timer Input
         hdltimer->Instance               = timbase;
//       rc = HAL_TIM_IC_Init (hdltimer);    // count mode = Input capture

       }
    if (rc != HAL_OK)
       {    // got a Base Timer/PWM Initialization Error - bail
         return (ERR_PWM_MODULE_INITIALIZE_FAILED);
       }

        //-----------------------------------------------------------------------
        // denote module has been initialized, and if Complementary PWM is used
        //-----------------------------------------------------------------------
    if (flags & PWM_COMPLEMENTARY_OUTPUTS)
            // user wants to run a pair of channels in complementary mode
       _g_tmpwm_module_status [module_id] = TMR_PWM_COMPLEMENT_INIT;
       else _g_tmpwm_module_status [module_id] = TMR_PWM_NORMAL_INIT; // no complementAry mode

    return (0);                              // denote completed OK
}

                       // The rest of the Physical Timers logic

//*****************************************************************************
//  board_timerpwm_check_completed
//
//        Checks to see if the timer has expired / completed it's cycle.
//        Optionally, resets the completion flag if denoted in reset_flags parm.
//
//        This is frowned upon (callbacks should be used instead), but some
//        people still want to occassionally do polling on this stuff.
//
//        Returns:
//              True  (1) = Completed
//              False (0) = Busy
//*****************************************************************************
int  board_timerpwm_check_completed (unsigned int module_id, int mask_flags, int reset_flags)
{
    TIM_HandleTypeDef   *hdltimer;
    TIM_TypeDef         *timbase;

    if (module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

            // get ptr to associated TIM register
    timbase  = (TIM_TypeDef*) _g_timer_module_base [module_id];
    if (timbase == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

      // based on module_id, setup pointer to associated timer objects
    hdltimer = (TIM_HandleTypeDef*) _g_timer_runtime_TIM_handle [module_id];
    if (hdltimer == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

       //-----------------------------------------------------------------------
       // Check Timer's UPDATE flag status, to see if a timer rollover occurred
       //-----------------------------------------------------------------------
    if (timbase->SR & TIM_SR_UIF)
       {      // yes, Timer has popped/rolled over
         if (reset_flags == 1)
            timbase->SR = ~(TIM_SR_UIF);
         return (1);                    // tell caller it popped
       }

//        __HAL_TIM_CLEAR_IT(htim, TIM_IT_UPDATE);
//#define __HAL_TIM_CLEAR_IT(__HANDLE__, __INTERRUPT__)
//             ((__HANDLE__)->Instance->SR = ~(__INTERRUPT__))
// #define TIM_IT_UPDATE     ((uint32_t)0x00000001)  =  TIM_SR_UIF

    return (0);                         // Timer has not popped yet
}


//*****************************************************************************
//  board_timerpwm_config_channel
//
//         Configure a specific channel (1-4) on a specific PWM module (TIM1/2/..)
//
//         For TIM1, allow complmentary mode usage.
//*****************************************************************************

int  board_timerpwm_config_channel (unsigned int module_id, int chan_id,
                                    long initial_duty, int mode, int flags)
{
    TIM_OC_InitTypeDef  pchanConfig;      // Timer Output CCR Config
    TIM_HandleTypeDef   *hdltimer;
    TMPWM_CHANNEL_BLK   *pwmblkp;
    int                 rc;
    int                 chan_index;
    uint32_t            hal_channel_num;
    unsigned char       chan_mask;
    unsigned char       rupt_mask;

    if (module_id > MAX_TIMER)
       return (ERR_PWM_MODULE_ID_OUT_OF_RANGE);

      // based on module_id, setup pointer to associated TIM module handle
    hdltimer = (TIM_HandleTypeDef*) _g_timer_runtime_TIM_handle [module_id];
    if (hdltimer == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

    if (_g_tmpwm_module_status [module_id] == 0)
       return (ERR_PWM_MODULE_NOT_INITIALIZED);

//  if ((_g_tmpwm_module_status[modgen_id] & TMR_PWM_NORMAL_INIT) == 0)
//     return (ERR_PWM_MODULE_IN_COMPLEMENTARY); // need to use pwm_config_channel_pair

    if (mode < 0 || mode > TIMER_MODE_PWM)
       return (ERR_PWM_INVALID_TIMER_MODE);

    memset (&pchanConfig, 0, sizeof(pchanConfig));   // clear struct

       //-----------------------------------------------
       // do any needed Auto Pre-Scaling on duty_cycle
       //-----------------------------------------------
    if ( _g_tmpwm_prescalars[module_id] > 0  &&  (flags & TIMER_AUTO_PRESCALE))
       { initial_duty = (initial_duty / _g_tmpwm_prescalars[module_id]);
       }

       //----------------------------------------------------------------
       // Convert extended channel numbers: ALT1 / ALT2 / _N / _N_ALT to
       // the underlying base channel number needed for HAL_TIM_PWM calls
       //----------------------------------------------------------------
    hal_channel_num = board_timerpwm_channel_lookup (chan_id, &chan_index);
    if (hal_channel_num == -1)
       return (ERR_TIMER_CHANNEL_NUM_OUT_OF_RANGE);  // passed bad chan_id value

