GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_timers.c
    chan_mask = _g_pwm_chan_mask [chan_index];   // get associated CCR mask bits

       //--------------------------------------------------------------
       // turn on PWM flag if this is a PWM based module/channel
       //--------------------------------------------------------------
    if (mode >= TIMER_MODE_PWM)
       {     // Denote that this channel is running as a PWM on this module.
             // Turn associated mask bit on for this channel in PWM status flags.
         _g_tmpwm_channels_pwm [module_id] |= chan_mask;
       }

       //------------------------------------------------------------------
       //                Check if running as TIMER ONLY
       //
       // Note: user can elect to run the CCR in _Timer mode only_, and not
       //       send any output to the GPIOs, e.g. simple timer using CCR.
       //
       // _HOWEVER_ for usage as a triggering source (ADC trigger or DAC
       // trigger), we still to enable the output compare (OC) options,
       // such as SET/RESET, TOGGLE, ... because the OC outputs are used to
       // fire the internal HW flip-flops that drive the ADC/DAC triggers.
       //------------------------------------------------------------------

    if (flags & TIMER_CCR_TIMER_ONLY)
       {     // explicitly skip over GPIO config, but continue on to
             // configure OC options
//       pchanConfig.OCPolarity  = TIM_OCPOLARITY_LOW;
       }
      else
       {   //------------------------------------------------------------------
           //     CONFIGURE  CCR's  associated  GPIO  pin  into Timer/PWM mode.
           //
           // Configure Timer/PWM Channel's GPIO pin into Alternate function,
           // push-pull, 100MHz speed.
           //
           // Note: user can elect to run the CCR in _Trigger mode only_, and not
           //       not send _external_ output to the GPIOs, e.g. Trigger for ADC/DAC.
           //       In that case, we configure all CCRs settings but leave
           //       the external GPIOs disabled. The internal CCR wiring only
           //       drives the ADC or DAC with the CCR timer outputs/flip-flops.
           //------------------------------------------------------------------
        pwmblkp = (TMPWM_CHANNEL_BLK*) _g_tmrpwm_mod_channel_blk_lookup [module_id];
        rc = board_timerpwm_config_gpios (pwmblkp, chan_id); // configure assoc GPIO
        if (rc < 0)
           return (rc);     // must be "not supported channel number" on this module
       }

       //------------------------------------------------------------
       // prepare to configure the associated Timer/PWM channel CCR
       //------------------------------------------------------------
    memset (&pchanConfig, '\0', sizeof(pchanConfig));   // ensure is cleared out

    if (mode == TIMER_MODE_OC_PASSTHRU)
       pchanConfig.OCMode = TIM_OCMODE_TIMING;           // Output is frozen to whatever POLARITY is set to
       else if (mode == TIMER_MODE_OC_SET)
               pchanConfig.OCMode = TIM_OCMODE_ACTIVE;   // set pin Active when CCR reached
       else if (mode == TIMER_MODE_OC_RESET)
               pchanConfig.OCMode = TIM_OCMODE_INACTIVE; // set pin Inactive when CCR hit
       else if (mode == TIMER_MODE_OC_TOGGLE)
               pchanConfig.OCMode = TIM_OCMODE_TOGGLE;   // TOGGLE pin when CCR hit
       else if (mode == TIMER_MODE_PWM)
               pchanConfig.OCMode = TIM_OCMODE_PWM1;     // PWM_1 mode
       else if (mode == TIMER_MODE_PWM_INV)
               pchanConfig.OCMode = TIM_OCMODE_PWM2;     // PWM_2 mode
       else return (ERR_PWM_INVALID_TIMER_MODE);

    if (flags & TIMER_PIN_POLARITY_LOW)
       pchanConfig.OCPolarity = TIM_OCPOLARITY_LOW;      // Pin is LOW when Active (inverted)
       else pchanConfig.OCPolarity = TIM_OCPOLARITY_HIGH;// Pin is HIGH when Active

#if defined(STM32L053xx) || defined(STM32L152xE)
          // L0 and L1 do not support OCIdleState
#else
    pchanConfig.OCIdleState = TIM_OCIDLESTATE_SET;      // make flags option in future
#endif
    pchanConfig.OCFastMode  = TIM_OCFAST_DISABLE;
    pchanConfig.Pulse       = initial_duty;      //Set initial duty cycle for channel

// ??? where how is this flag ever set ??? should it be derived from GPIO pin lookup ? !!!  PROBABLY
    if (flags & PWM_COMPLEMENTARY_OUTPUTS)
       {    // user wants to run a pair of channels in complementary mode.
            // turn on the extra parms needed for Complementary support.
            // "N" alternate channel settings
// *** NEEDS MORE WORK - ALSO NEED TO ENABLE ASSOCIATE GPIO PINS  ??? !!!  05/19/15
         if (module_id != 1 || chan_index > 3)
            return (ERR_PWM_MODULE_NO_COMPLEMENTARY); // only TIM1 supports complementary
#if defined(TIM_OCNPOLARITY_HIGH)      // L0 not support
         pchanConfig.OCNPolarity  = TIM_OCNPOLARITY_HIGH;   // Flags option in future
         pchanConfig.OCNIdleState = TIM_OCNIDLESTATE_RESET; // Flags option in future
#endif
         _g_tmpwm_channels_pwm [module_id] |= _g_pwm_chan_mask [chan_index+4];  // turn on comple N bits
         chan_mask |= _g_pwm_chan_mask [chan_index+4];      // add in comple N bits
       }

       //-----------------------------------------------------------------------
       // Have HAL routines configure associated CCTL register bits for Channel
       //-----------------------------------------------------------------------
    if ((_g_tmpwm_channels_pwm [module_id] & chan_mask) != 0)
       rc = HAL_TIM_PWM_ConfigChannel (hdltimer, &pchanConfig,
                                       hal_channel_num); // config for PWM mode output
       else rc = HAL_TIM_OC_ConfigChannel (hdltimer, &pchanConfig,
                                       hal_channel_num); // config for OC mode output
    if (rc != HAL_OK)
       {
         return (ERR_PWM_CHANNEL_CONFIG_FAILED);  // Config Channel Error - bail
       }

       //--------------------------------------------------------------
       // turn on any needed interrupt flags for this CCR
       //--------------------------------------------------------------
    if (flags & TIMER_CCR_INTERRUPT_ENABLED)
       { rupt_mask = _g_tmpwm_CCR_rupt_flags [chan_index];
             // save what interrupts the User App wants to see
         _g_timer_app_enabled_interrupts [module_id] |= rupt_mask;
       }

       //----------------------------------------------------------------------
       // for this Timer/PWM module, set the bit corresponding for this channel
       // CCR to denote that it has been configured, and should be enabled.
       //----------------------------------------------------------------------
    _g_tmpwm_channels_config [module_id] |= chan_mask;

    return (0);               // denote successful configuration
}


//*****************************************************************************
//  board_timerpwm_config_trigger_mode                         TRIGGER
//
//         Sets up a Timer to provide Trigger Output (CCR or Rollover based
//         TRGO triggers), which is used to trigger either ADCs or DACs.
//
//         As per the STM32 Tech Ref, the _ADC Timer should already be enabled_
//         _before calling this routine_.
//
//         The trigger type must match what was specified on the adc_init()
//         or dac_init() call, otherwise an error is signalled.
//
// flags parm can have TIMER_TRIGGER_MODE set, indicating to ensure that the
//       CCR OUTMOD is set to some kind of toggle (MOD_3 / MOD_6/ MOD_7) state.
//*****************************************************************************
int  board_timerpwm_config_trigger_mode (unsigned int module_id, int adc_dac_id,
                                         int trigger_type,
                                         int flags)
{
    TIM_MasterConfigTypeDef   MasterSlaveConfig;
    TIM_HandleTypeDef         *hdltimer;
    TIM_TypeDef               *timbase;
    int                       ccr_bits;
    int                       channel_mask;
    uint16_t                  app_trigger_tmr_mmsmask;
    uint16_t                  app_trigger_user_api_id;

    if (module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

      // based on module_id, setup pointer to associated timer objects
    hdltimer = (TIM_HandleTypeDef*) _g_timer_runtime_TIM_handle [module_id];
    if (hdltimer == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

    memset (&MasterSlaveConfig, 0, sizeof(MasterSlaveConfig));   // clear struct

        //------------------------------------------------------------------
        //                Handle any ADC or DAC Triggering details
        //
        // Need to handle the case where user issued adc_init() _after_
        // timer_ADC_Trigger_Start(), in which case we need to also
        // turn on the associated Timer's MMS flags, to enable it to broadcast
        // trigger signals to the ADC.
        //
        // If GPIO EXTI triggering was used instead, need to ensure it is setup
        //----------------------------------------------------------------------
    timbase  = (TIM_TypeDef*) _g_timer_module_base [module_id];
    hdltimer->Instance = timbase;   // ensure Instance is setup: for Trigger
                                    // only scenarios it may not have been setup
    if (trigger_type != 0)
       {
         if (trigger_type  < ADC_TRIGGER_USER_APP || flags & TIMER_ADC_TRIGGER_MODE)
            {      //------------------------------
                   //  Process ADC based triggers
                   //------------------------------
                   // for ADCs, adc_dac_id = ADC module id
              board_adc_get_app_trigger_masks (adc_dac_id,
                                               &app_trigger_tmr_mmsmask,
                                               &app_trigger_user_api_id);
              if (app_trigger_tmr_mmsmask == 0)
                 return (ERR_TIMER_ADC_NOT_INITIALIZED);
              if (app_trigger_user_api_id != trigger_type)
                 return (ERR_TIMER_TRIGGER_MISMATCH);
                    //----------------------------------------------------------
                    // See if this is a CCR type trigger, and if so, see if the
                    // associated Timer's CCR channel was configured by the user.
                    // If not, we will auto-configure it with a default set of
                    // values. If the caller later calls timer_Enable_CCR_Output()
                    // it will just overlay our default CCR values.
                    //----------------------------------------------------------
              ccr_bits = (app_trigger_user_api_id & 0x07); // L.O. 3 bits = CCR
              channel_mask = _g_pwm_chan_mask [ccr_bits];  // get assoc config bit mask
              if (ccr_bits != 0)
                 {       // This trigger is using a Timer CCR
                  if ((_g_tmpwm_channels_config [module_id] & channel_mask) == 0)
                    {    //-----------------------------------------------------
                         // CCR has not been configured. Set it up with default
                         // values. Set default CCR value = Timer's period (ARR)
                         //-----------------------------------------------------
                      board_timerpwm_config_channel (module_id,    // timer
                                              (int)  ccr_bits,     // channel
                                              (long) timbase->ARR, // Period->CCR
                                              (int)  TIMER_MODE_OC_TOGGLE,
                                              (int)  (TIMER_CCR_TIMER_ONLY) );
                    }
                 }
                  // Then setup Timer to issue a TRG0 event whenever the Timer
                  // performs the requested Update or CCR event
              MasterSlaveConfig.MasterOutputTrigger = app_trigger_tmr_mmsmask;
              MasterSlaveConfig.MasterSlaveMode     = TIM_MASTERSLAVEMODE_DISABLE;
              HAL_TIMEx_MasterConfigSynchronization (hdltimer, &MasterSlaveConfig);
            }
           else if (trigger_type == ADC_TRIGGER_GPIO_PIN)
                   {       // process ADC trigger caused by GPIO
// ??? TBD
                     return (0);     // no MMS update needed for EXTI GPIO
                   }
           else if (trigger_type == DAC_TRIGGER_GPIO_PIN)
                   {       // process DAC trigger caused by GPIO
// ??? TBD
                     return (0);     // no MMS update needed for EXTI GPIO
                   }
           else if (trigger_type >= DAC_TRIGGER_TIMER_2 && trigger_type < DAC_TRIGGER_GPIO_PIN)
                   {    //------------------------------
                        //   Process DAC triggers
                        //------------------------------
#if defined(STM32F401xE) || defined(STM32F401xC) || defined(STM32F411xE)
                        //******************************************************
                        //  Handle MCUs that do not have ang native DAC support
                        //******************************************************
                     return (ERR_DAC_NOT_SUPPORTED_ON_THIS_MCU); //no native DAC
#else
                        // for DACs, adc_dac_id = DAC _channel_ id
                     board_dac_get_app_trigger_masks (adc_dac_id,
                                                      &app_trigger_tmr_mmsmask,
                                                      &app_trigger_user_api_id);
                     if (app_trigger_tmr_mmsmask == 0)
                        return (ERR_TIMER_DAC_NOT_INITIALIZED);
                     if (app_trigger_user_api_id != trigger_type)
                        return (ERR_TIMER_TRIGGER_MISMATCH);
                       //-------------------------------------------------------
                       // See if this is a CCR type trigger, and if so, see if the
                       // associated Timer's CCR channel was configured by the user.
                       // If not, we will auto-configure it with a default set of
                       // values. If the caller later calls timer_Enable_CCR_Output()
                       // it will just overlay our default CCR values.
                       //-------------------------------------------------------
                     ccr_bits     = (app_trigger_tmr_mmsmask & 0x07); // L.O. 3 bits = CCR
                     channel_mask = _g_pwm_chan_mask [ccr_bits];  // get assoc config bit mask
                     if (ccr_bits != 0)
                        if ((_g_tmpwm_channels_config [module_id] & channel_mask) == 0)
                          {  //-------------------------------------------------
                             // Has not been configured. Set it up with default
                             // values. Set default CCR value = Timer's period (ARR)
                             //-------------------------------------------------
                            board_timerpwm_config_channel (module_id,
                                                     (int) ccr_bits,
                                                    (long) timbase->ARR,
                                                     (int) TIMER_MODE_OC_SET_RESET,
                                                     (int) (TIMER_CCR_TIMER_ONLY) );
                          }
                        // Then setup Timer to issue a TRG0 event whenever the Timer
                        // performs the requested Update or CCR event
                     MasterSlaveConfig.MasterOutputTrigger = app_trigger_tmr_mmsmask;
                     MasterSlaveConfig.MasterSlaveMode     = TIM_MASTERSLAVEMODE_DISABLE;
                     HAL_TIMEx_MasterConfigSynchronization (hdltimer, &MasterSlaveConfig);
#endif
                   }
           else return (ERR_TIMER_INVALID_TRIGGER_TYPE);
       }

    return (0);              // denote completed ok
}


//*****************************************************************************
//  board_timerpwm_disable
//
//            Turns off a timer/pwm, and disables any interrupts for it.
//            (e.g. in preparation for Stopping or Reconfiguring a motor, ...)
//*****************************************************************************
int  board_timerpwm_disable (unsigned int module_id, int flags)
{
    TIM_HandleTypeDef   *hdltimer;

    if (module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

