GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_timers.c
    if (_g_tmpwm_module_status [module_id] == 0)
       return (ERR_PWM_MODULE_NOT_INITIALIZED);

      // based on module_id, setup pointer to associated timer objects
    hdltimer = (TIM_HandleTypeDef*) _g_timer_runtime_TIM_handle [module_id];
    if (hdltimer == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

      // Turn off the Timer Enabled flag
    _g_timer_enable_status [module_id] &= ~(TIMER_IRQ_STARTED);

// ??? TBD   stop every PWM channel that is enabled on this module    ??? !!!

    if (_g_tmpwm_module_status [module_id] & TMR_PWM_INTERRUPTS_USED)
       HAL_TIM_Base_Stop_IT (hdltimer);    // Disable the timer and interrupts
       else HAL_TIM_Base_Stop (hdltimer);  // Disable the Timer


// ??? !!! Disable before/after OC Timer_Disable ??? !!!  FUTURE
// ???     associated Compare/Capture OC elements must also be disabled !!!
//  HAL_TIM_OC_Stop_IT (hdltimer, Channel);
// ??? must associated Compare/Capture OC elements also be stopped ?
//  HAL_TIM_IC_Stop_IT (hdltimer, Channel);  // input capture

    return (0);                         // denote completed OK
}



//*****************************************************************************
//  board_timerpwm_enable
//
//         Enables and Starts the timer/PWM.
//
//         Sets up any desired Timer interrupt flags, then enables the Timer/PWM.
//         Saves optional callback function address to call when interrupt occurs.
//
//  PARMS:
//      interrupt_flags  interrupts used. Valid values:
//       - TIMER_PERIOD_INTERRUPT_ENABLED
//*****************************************************************************

int  board_timerpwm_enable (unsigned int module_id, int interrupt_flags)
{
    TIM_HandleTypeDef  *hdltimer;
    int                irqn;
    int                rc;
    int                app_ccr_rupts;
    unsigned char      channels_config;
    unsigned char      pwm_config;

    if (module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

       // based on module_id, setup pointer to associated timer objects
    hdltimer = (TIM_HandleTypeDef*) _g_timer_runtime_TIM_handle [module_id];
    if (hdltimer == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

    if (_g_tmpwm_module_status [module_id] == 0)
       return (ERR_PWM_MODULE_NOT_INITIALIZED);

// 07/26/15: CAUTION: if the Timer was already previously enabled
//           the HAL code will blow up into a Hard Fault if we re-do
//           the Set_IRQ call and the __HAL_TIM_ENABLE() call in HAL_TIM_Base_Start()

       //-----------------------------------------------------------------------
       // If user requested a Rollover interrupt,  OR  setup interrupts on a CCR
       // then enable the necessary NVIC entry
       //-----------------------------------------------------------------------
                   // find and set associated NVIC IRQ value
    irqn = _g_TMPWM_IRQ_table [module_id];
    if ((interrupt_flags & TIMER_PERIOD_INTERRUPT_ENABLED)
      || _g_timer_app_enabled_interrupts[module_id])     // configured CCR rupts
       {
             //------------------------------------------------
             // If this timer was already started, and/or IRQ already setup
             // re-executing this logica will cause HAL_timxxx() code
             // to drop into a Hard Fault. So check if already enabled
             // and hand back a waring to the User App that it was already started.
             //------------------------------------------------
         if (_g_timer_enable_status [module_id] &= TIMER_IRQ_STARTED)
            return (WARN_TIMER_WAS_ALREADY_STARTED);

             // denote this module is running with Interrupts
         _g_tmpwm_module_status [module_id] |= TMR_PWM_INTERRUPTS_USED;
         if (interrupt_flags & TIMER_PERIOD_INTERRUPT_ENABLED)
            {     //------------------------------------------------------------
                  // set assoc Period ROLLOVER/Update flag for the overall Timer
                  //------------------------------------------------------------
              _g_timer_app_enabled_interrupts[module_id] |= TIM_SR_UIF;
#if defined(HAS_TIM20)
              if (module_id == 20)
                 {     // TIM20 has a separate IRQn for ROLLOVERs/Updates
                   NVIC_EnableIRQ (TIM20_UP_IRQn);              // Enable NVIC
                   NVIC_SetPriority (TIM20_UP_IRQn, 1);
                 }
#endif
#if defined(HAS_TIM8)
              if (module_id == 8)
                 {          // TIM8 has a separate IRQn for ROLLOVERs/Updates
   #if defined(STM32F303xE) || defined(STM32F303xC) || defined(STM32L476xx)
                            // just to be annoying, F3_03 uses diff NVIC id
                   NVIC_EnableIRQ (TIM8_UP_IRQn);                // Enable NVIC
                   NVIC_SetPriority (TIM8_UP_IRQn, 1);
   #else
                   NVIC_EnableIRQ (TIM8_UP_TIM13_IRQn);          // Enable NVIC
                   NVIC_SetPriority (TIM8_UP_TIM13_IRQn, 1);
   #endif
                 }
               else if (module_id == 1)
                 {          // TIM1 has a separate IRQn for ROLLOVERs/Updates
   #if defined(STM32F303xE) || defined(STM32F303xC) || defined(STM32L476xx)
                            // just to be annoying, F3_03 uses diff NVIC id
                    NVIC_EnableIRQ (TIM1_UP_TIM16_IRQn);         // Enable NVIC
                    NVIC_SetPriority (TIM1_UP_TIM16_IRQn, 1);
   #else
                    NVIC_EnableIRQ (TIM1_UP_TIM10_IRQn);         // Enable NVIC
                    NVIC_SetPriority (TIM1_UP_TIM10_IRQn, 1);
   #endif
                 }
               else
#elif defined(HAS_TIM10)
              if (module_id == 1)
                 {          // TIM1 has a separate IRQn for ROLLOVERs
  #if ! defined(STM32L152xE)
                    NVIC_EnableIRQ (TIM1_UP_TIM10_IRQn);         // Enable NVIC
                    NVIC_SetPriority (TIM1_UP_TIM10_IRQn, 1);
  #endif
                 }
               else
#endif
                {           // handle all the other timers ROLLOVERs
                            // find and set associated NVIC IRQ value
                    NVIC_EnableIRQ (irqn);                       // Enable NVIC
                    NVIC_SetPriority (irqn, 1);
                }
            }

