GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_timers.c
           else {         //-----------------------------------------------
                          // handle all CCRs and TIM1/TIM8 CCRs conditions
                          // find and set associated NVIC IRQ value
                          //-----------------------------------------------
                     NVIC_EnableIRQ (irqn);                      // Enable NVIC
                     NVIC_SetPriority (irqn, 1);
                }

                   //---------------------------------------------------
                   //  Enable the Timer/PWM to start, _with_ Interrupts
                   //---------------------------------------------------
          HAL_TIM_Base_Start_IT (hdltimer);
          _g_timer_enable_status [module_id] |= TIMER_IRQ_STARTED;
        }

       else {      // No interrupts - just start the timer
                   // First check if it was already started. Bail if it already was
              if (_g_timer_enable_status [module_id] &= TIMER_IRQ_STARTED)
                 return (WARN_TIMER_WAS_ALREADY_STARTED);
                   //------------------------------------------------
                   // Enable Timer/PWM to start,  _no_ interrupts
                   //------------------------------------------------
              HAL_TIM_Base_Start (hdltimer);
              _g_timer_enable_status [module_id] |= TIMER_IRQ_STARTED;
            }

       //------------------------------------------------------------------------
       //                           CCR Startup
       // Startup each Timer/PWM channel that has been configured for this module
       //
       // After the main timer has been started, walk through and enable
       // each CCR requested by the user app. This will turn on the Output at
       // the GPIO pin, and turn on the associated CCR interrupt if requested.
       // Note: there is no substanitive difference between HAL_TIM_PWM_Start()
       //       and HAL_TIM_OC_Start()
       //------------------------------------------------------------------------
    channels_config = _g_tmpwm_channels_config [module_id];        // get local copy of CCR configed flags
    pwm_config      = _g_tmpwm_channels_pwm [module_id];
    app_ccr_rupts   = _g_timer_app_enabled_interrupts [module_id]; // get local copy of CCR interrupts
    if (channels_config  &  TMR_CCR1_CONFIGURED)
       {     // start channel 1, and optionally, channel 1N
         if (app_ccr_rupts & TIM_SR_CC1IF)
            {    // User wants to see interrupts on this CCR
              __HAL_TIM_ENABLE_IT (hdltimer, TIM_IT_CC1);      // Enable CCR1 rupt
            }
         if (pwm_config & TMR_CCR1_CONFIGURED)
            rc = HAL_TIM_PWM_Start (hdltimer, TIM_CHANNEL_1);  // start as PWM
            else rc = HAL_TIM_OC_Start (hdltimer, TIM_CHANNEL_1);
#if defined(HAL_TIMEx_PWMN_Start)      // L0 not support complementary
         if (channels_config  &  TMR_CCR1N_CONFIGURED  &&  rc == HAL_OK)
            {    // operating in (PWM) complementary mode - turn on channel 1N too
              rc = HAL_TIMEx_PWMN_Start (hdltimer, TIM_CHANNEL_1);
            }
#endif
         if (rc != HAL_OK)
            return (ERR_PWM_CHANNEL_START_FAILED);        // start failed - bail
       }

    if (channels_config  &  TMR_CCR2_CONFIGURED)
       {     // start channel 2, and optionally, channel 2N
         if (app_ccr_rupts & TIM_SR_CC2IF)
            {    // User wants to see interrupts on this CCR
              __HAL_TIM_ENABLE_IT (hdltimer, TIM_IT_CC2);  // Enable CCR2 rupt
            }
         if (pwm_config & TMR_CCR2_CONFIGURED)
            rc = HAL_TIM_PWM_Start (hdltimer, TIM_CHANNEL_2);  // Start as PWM
            else rc = HAL_TIM_OC_Start (hdltimer, TIM_CHANNEL_2);
         if (rc != HAL_OK)
            return (ERR_PWM_CHANNEL_START_FAILED);      // start failed - bail
#if defined(HAL_TIMEx_PWMN_Start)      // L0 not support complementary
         if (channels_config  &  TMR_CCR2N_CONFIGURED  &&  rc == HAL_OK)
            {    // operating in complementary mode - turn on channel 2N too
              rc = HAL_TIMEx_PWMN_Start (hdltimer, TIM_CHANNEL_2);
            }
         if (rc != HAL_OK)
            return (ERR_PWM_CHANNEL_START_FAILED);      // start failed - bail
#endif
       }

    if (channels_config  &  TMR_CCR3_CONFIGURED)
       {     // start channel 3, and optionally, channel 3N
         if (app_ccr_rupts & TIM_SR_CC3IF)
            {    // User wants to see interrupts on this CCR
              __HAL_TIM_ENABLE_IT (hdltimer, TIM_IT_CC3);  // Enable CCR3 rupt
            }
         if (pwm_config & TMR_CCR3_CONFIGURED)
            rc = HAL_TIM_PWM_Start (hdltimer, TIM_CHANNEL_3);  // Start as PWM
            else rc = HAL_TIM_OC_Start (hdltimer, TIM_CHANNEL_3);
#if defined(HAL_TIMEx_PWMN_Start)      // L0 not support complementary
         if (channels_config  &  TMR_CCR3N_CONFIGURED  &&  rc == HAL_OK)
            {    // operating in complementary mode - turn on channel 3N too
              rc = HAL_TIMEx_PWMN_Start (hdltimer, TIM_CHANNEL_3);
            }
#endif
         if (rc != HAL_OK)
            return (ERR_PWM_CHANNEL_START_FAILED);      // start failed - bail
       }

    if (channels_config  &  TMR_CCR4_CONFIGURED)
       {     // start channel 4
         if (app_ccr_rupts & TIM_SR_CC4IF)
            {    // User wants to see interrupts on this CCR
              __HAL_TIM_ENABLE_IT (hdltimer, TIM_IT_CC4);  // Enable CCR4 rupt
            }
         if (pwm_config & TMR_CCR4_CONFIGURED)
            rc = HAL_TIM_PWM_Start (hdltimer, TIM_CHANNEL_4);
            else rc = HAL_TIM_OC_Start (hdltimer, TIM_CHANNEL_4);
         if (rc != HAL_OK)
            return (ERR_PWM_CHANNEL_START_FAILED);      // start failed - bail

         // Channel 4 does _NOT_ have a complementary output (no channel 4N) !
       }

    return (0);                         // denote completed OK
}

//#endif                                  //  USES_PWM  ||  USES_TIMER


//#if defined(USES_TIMER) || defined(USES_PWM)

//*****************************************************************************
//  board_timerpwm_enable_CCR_output
//
//        Configures and enables Timer Output Compare wave generation on the
//        requested channel, and its associated GPIO pin and CCR.
//
//    Parameters:
//        initial_duty - specifies the associated "duty cycle" for the pin's
//                       CCR register to be set to
//
//        action_flags:
//          - TIMER_ACTION_TOGGLE     toggle the OC GPIO output every time
//                                    the CCR value reached,
//          - TIMER_ACTION_GO_ACTIVE  wait till CCR value reached, then drive
//                                    the OC GPIO output high
//                                    (and leave it there forever until reset)
//          - TIMER_ACTION_PULSE      similar to the above
//          - TIMER_ACTION_GO_INACTIVE  wait till CCR value reached, then drive
//                                    the OC GPIO output low
//                                    (and leave it there forever until reset)
//          - TIMER_PIN_POLARITY_HIGH the GPIO pin goes high when CCR hit
//          - TIMER_PIN_POLARITY_LOW  the GPIO pin goes low when CCR hit (Inverted output)
//
//        interrupt_flags:
//          - TIMER_NO_INTERRUPT     no interrupts are signalled when CCR value
//                                   is reached.
//          - TIMER_ENABLE_CCR_INTERRUPTS   an interrupt is signalled when CCR
//                                   value hit is reached. It will invoke the
//                                   callback_function that was provided on the
//                                   board_timerpwm_enable() call. It will pass
//                                   to the callback function the callback_parm
//                                   and a TIMER_xxxx_INTERRUPT flag.
//*****************************************************************************
int  board_timerpwm_enable_CCR_output (unsigned int module_id, int chan_id,
                                       long initial_duty,
                                       int action_flags, int extended_flags)
{
    int         mode;
    int         rc;
    int         flags;

       // tweak parms to match board_timerpwm_config_channel() format
    mode   = action_flags   & 0x000F;   // extract mode bits only
    flags  = extended_flags & 0xFFF0;
    flags |= (action_flags  & 0x0FF0);  // move over to extended flags

       // all heavy lifting is done by board_timerpwm_config_channel()
    rc = board_timerpwm_config_channel (module_id,
                                        chan_id,
                                        initial_duty,
                                        mode,  flags);

    return (rc);                      // denote worked successfully
}



//*****************************************************************************
//  board_timerpwm_get_current_value
//
//         Gets the current count value (CNT) in the Timer/PWM.
//*****************************************************************************
long  board_timerpwm_get_current_value (unsigned int module_id)
{
    TIM_TypeDef      *timbase;
    long             curr_count;

    if (module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

