GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_timers.c
            // get ptr to associated TIM register
    timbase  = (TIM_TypeDef*) _g_timer_module_base [module_id];
    if (timbase == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

    curr_count = timbase->CNT;      // get currnet COUNT value

       //---------------------------------------------------------------
       // re-adjust COUNT value based on pre-scalar to get user's view
       //---------------------------------------------------------------
    if (_g_tmpwm_prescalars[module_id] > 0)
       curr_count = (curr_count * _g_tmpwm_prescalars[module_id]);

    return (timbase->CNT);          // pass back adjusted current counter value
}


//*****************************************************************************
//  board_timerpwm_get_CCR_capture_value
//
//         Gets the recorded input capture value in the Timer/PWM.
//*****************************************************************************
long  board_timerpwm_get_CCR_capture_value (unsigned int module_id, int CCR_channel_id)
{
    TIM_HandleTypeDef   *hdltimer;
    long                cap_value;

    if (module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

       // based on module_id, setup pointer to associated timer objects
    hdltimer = (TIM_HandleTypeDef*) _g_timer_runtime_TIM_handle [module_id];
    if (hdltimer == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

    cap_value = HAL_TIM_ReadCapturedValue (hdltimer, CCR_channel_id);

// ??? !!! must I adjust the value based on pre-scalar used ??? !!!

    return (cap_value);             // passback capture value
}


//*****************************************************************************
//  board_timerpwm_get_duty_cycle
//
//        Get the Timer/PWM's current duty cycle.      Used for monitoring, etc
//*****************************************************************************

long  board_timerpwm_get_duty_cycle (unsigned int module_id, int chan_id)
{
    TIM_TypeDef      *timbase;
    long             curr_duty;
    int              hal_channel_num;
    int              chan_index;

    if (module_id > MAX_TIMER)
       return (ERR_PWM_MODULE_ID_OUT_OF_RANGE);

            // get ptr to associated TIM register
    timbase  = (TIM_TypeDef*) _g_timer_module_base [module_id];
    if (timbase == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

       //----------------------------------------------------------------
       // Convert extended channel numbers: ALT1 / ALT2 / _N / _N_ALT to
       // the underlying base channel number needed for HAL_TIM_PWM calls
       //----------------------------------------------------------------
    hal_channel_num = board_timerpwm_channel_lookup (chan_id, &chan_index);
    if (hal_channel_num == -1)
       return (ERR_TIMER_CHANNEL_NUM_OUT_OF_RANGE);  // passed bad chan_id value

    switch (chan_index)
      { case 1:
              curr_duty = timbase->CCR1;
              break;
        case 2:
              curr_duty = timbase->CCR2;
              break;
        case 3:
              curr_duty = timbase->CCR3;
              break;
        case 4:
              curr_duty = timbase->CCR4;
              break;
        default:
                // this must be one of the N channels -
                // it does _NOT_ have its own CCRxN.  It relies on CCR1/1/3/4
              return (ERR_PWM_CHANNEL_COMPLE_CHAN_NO_CCR);
      }

       //-------------------------------------------------------------
       // re-adjust duty value based on pre-scalar to get user's view
       //-------------------------------------------------------------
    if (_g_tmpwm_prescalars[module_id] > 0)
       curr_duty = (curr_duty * _g_tmpwm_prescalars[module_id]);

    return (curr_duty);
}


//*****************************************************************************
//  board_timerpwm_get_period
//
//         Gets the period value (ARR) being used by the Timer/PWM.
//         Used for monitoring, etc
//*****************************************************************************
long  board_timerpwm_get_period (unsigned int module_id)
{
    TIM_TypeDef      *timbase;
    long             curr_period;

    if (module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

            // get ptr to associated TIM register
    timbase  = (TIM_TypeDef*) _g_timer_module_base [module_id];
    if (timbase == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

    curr_period = timbase->ARR;     // get currnet PERIOD value

       //---------------------------------------------------------------
       // re-adjust period value based on pre-scalar to get user's view
       //---------------------------------------------------------------
    if (_g_tmpwm_prescalars[module_id] > 0)
       curr_period = (curr_period * _g_tmpwm_prescalars[module_id]);

    return (curr_period);          // pass back adjusted current period value
}


//*****************************************************************************
//  board_timerpwm_get_handle
//
//         debugging hook used during board bring up to test new MCUs Timer/PWM.
//*****************************************************************************

TIM_HandleTypeDef *board_timerpwm_get_handle (unsigned int module_id)
{
    TIM_HandleTypeDef   *hdltimer;

       // based on module_id, setup pointer to associated timer objects
    hdltimer = (TIM_HandleTypeDef*) _g_timer_runtime_TIM_handle [module_id];

    return (hdltimer);               // return HAL related SPI handle
}


//*****************************************************************************
//  board_timerpwm_reset_CCR_output
//
//        Re-Configures and shuts off Timer Output Compare wave generation on
//        the requested channel.
//
//        This is used to turn off a CCR GPIO pin that was triggerred to a
//        constant value (e.g. reset a one-shot, in preparation for another
//        action).
//
//        This function is mainly used for OC modes:
//          - TIMER_ACTION_GO_ACTIVE  which will drive the OC output high
//                                    (and leave it there forever until reset)
//          - TIMER_ACTION_PULSE
//          - TIMER_ACTION_GO_INACTIVE  which will drive the OC output low
//                                    (and leave it there forever until reset)
//
//        flags - future use
//*****************************************************************************
int  board_timerpwm_reset_CCR_output (unsigned int module_id, int chan_num, int flags)
{
    uint32_t    timer_base_addr;
    int         mode;

    if (module_id >= MAX_TIMER)
       return (ERR_PWM_MODULE_ID_OUT_OF_RANGE);
    if (chan_num < 1  ||  chan_num > TMRPWM_MAX_CHANNELS)
       return (ERR_PWM_CHANNEL_NUM_OUT_OF_RANGE);


#if (MSP432_CODE)      //  !!! NEED TO CREATE EQUIV FOR STM32  ??? !!!

    timer_base_addr = _g_timer_base_address [module_id];  // get approp TA0-TA3

    mode = OUTMOD_5;                    // config CCR to shutoff GPIO   or use OUTMOD_0 ?
    switch (chan_num)
       { case 1:                        //   TAn  CCR1
               HWREG16(timer_base_addr + OFS_TA0CCTL1)  = mode;
               break;
         case 2:                        //   TAn  CCR2
               HWREG16(timer_base_addr + OFS_TA0CCTL2) = mode;
               break;
         case 3:                        //   TAn  CCR3
               HWREG16(timer_base_addr + OFS_TA0CCTL3) = mode;
               break;
         case 4:                        //   TAn  CCR4
               HWREG16(timer_base_addr + OFS_TA0CCTL4) = mode;
               break;
         case 5:                        //   TAn  CCR5
               HWREG16(timer_base_addr + OFS_TA0CCTL5) = mode;
               break;
         case 6:                        //   TAn  CCR6
               HWREG16(timer_base_addr + OFS_TA0CCTL6) = mode;
               break;
       }
#endif

    return (0);                      // denote worked successfully
}


//*****************************************************************************
//  board_timerpwm_set_callback
//
//          callback_function and callback_parm are used to provide callback
//          when any Timer rollover or CCR interrupts occur.
//*****************************************************************************
int  board_timerpwm_set_callback (unsigned int module_id,
                                  TMR_CB_EVENT_HANDLER callback_function,
                                  void *callback_parm)
{
    if (module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

       //-------------------------------------------------------------------
       // Save any call back information, for interrupts (CCRs or Rollover)
       //-------------------------------------------------------------------
    _g_ptimer_callback [module_id]      = callback_function;
    _g_ptimer_callback_parm [module_id] = callback_parm;

