GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_timers.c
    return (0);                 // denote completed OK
}



//*****************************************************************************
//  board_timerpwm_set_channel_output
//
//         Set polarity of Timer/PWM channel output (start high or low)
//*****************************************************************************
int  board_timerpwm_set_channel_output (unsigned int module_id, int chan_id,
                                        int output_mode, int flags)
{
    TIM_HandleTypeDef   *tmrpwm_mhdl;
    int                 rc;
    int                 hal_channel_num;
    int                 chan_index;

    if (module_id > MAX_TIMER)
       return (ERR_PWM_MODULE_ID_OUT_OF_RANGE);

       //----------------------------------------------------------------
       // Convert extended channel numbers: ALT1 / ALT2 / _N / _N_ALT to
       // the underlying base channel number needed for HAL_TIM_PWM calls
       //----------------------------------------------------------------
    hal_channel_num = board_timerpwm_channel_lookup (chan_id, &chan_index);
    if (hal_channel_num == -1)
       return (ERR_TIMER_CHANNEL_NUM_OUT_OF_RANGE);  // passed a bad chan_id value

            // get ptr to associated TIM module handle
    tmrpwm_mhdl = (TIM_HandleTypeDef*) _g_timer_runtime_TIM_handle [module_id];
    if (tmrpwm_mhdl == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);


//   ???   TBD



    return (0);                // denote completed successfully
}


//*****************************************************************************
//  board_timerpwm_set_dead_time
//
//         Set the PWM's dead time between complementary PWM
//         arrangements.  Use to avoid "shoot through" on the
//         output FETs when working with Power or Motor H-bridges.
//*****************************************************************************

int  board_timerpwm_set_dead_time (unsigned int module_id, int rising_edge,
                                   int falling_edge)
{
    TIM_TypeDef         *timbase;
    int                 rc;
    uint32_t            scaleduty;

#if defined(STM32L152xE)
    return (ERR_PWM_MODULE_NO_DEADTIME);
#else
    if (module_id != 1 && module_id != 8)
       return (ERR_PWM_MODULE_NO_DEADTIME);  // Only TIM1/TIM8 support Deadtime

    if (module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

            // get ptr to associated TIM register
    timbase  = (TIM_TypeDef*) _g_timer_module_base [module_id];
    if (timbase == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

    timbase->BDTR &= ~(0xFF00);               // clear out any previous DT value
    timbase->BDTR |= (rising_edge & 0x00FF);  // set 8 bit deadtime

       // trailing edge is ignored, because STM32 F7 TIM1 only supports a
       // single deadtime value, that is used on both rising and falling edges.

    return (0);                // denote completed successfully
#endif

}


//******************************************************************************
//  board_timerpwm_set_duty_cycle
//
//        Set the Timer/PWM's duty cycle, aka
//        sets a CCR (compare count register) on the specified timer.
//
//        This is used to set different "duty cycles" for wave form values
//        being generated by a Timer, e.g. CCR1 might generate a 25 % duty
//        cycle on channel 1 pin, 33 % on channel 2 pin, and 50 % on chan 3 pin.
//
//        The flags parms is used to specify if a CCR interrupt should be
//        generated when the CCR compare value is hit by the Timer/PWM.
//******************************************************************************
int  board_timerpwm_set_duty_cycle (unsigned int module_id, int chan_id,
                                    long ccr_duty_cycle, int flags)
{
    TIM_TypeDef         *timbase;
    int                 hal_channel_num;
    int                 chan_index;

    if (module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

            // get ptr to associated TIM register
    timbase  = (TIM_TypeDef*) _g_timer_module_base [module_id];
    if (timbase == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

       //----------------------------------------------------------------
       // Convert extended channel numbers: ALT1 / ALT2 / _N / _N_ALT to
       // the underlying base channel number needed for HAL_TIM_PWM calls
       //----------------------------------------------------------------
    hal_channel_num = board_timerpwm_channel_lookup (chan_id, &chan_index);
    if (hal_channel_num == -1)
       return (ERR_TIMER_CHANNEL_NUM_OUT_OF_RANGE);  // passed bad chan_id value

       //----------------------------------------------
       // do any needed Auto Pre-Scaling on duty_cycle
       //----------------------------------------------
    if ( _g_tmpwm_prescalars[module_id] > 0 && (flags & TIMER_AUTO_PRESCALE))
       { ccr_duty_cycle = (ccr_duty_cycle / _g_tmpwm_prescalars[module_id]);
       }

    switch (chan_index)
      {
        case 1:
               timbase->CCR1 = ccr_duty_cycle;
               break;
        case 2:
               timbase->CCR2 = ccr_duty_cycle;
               break;
        case 3:
               timbase->CCR3 = ccr_duty_cycle;
               break;
        case 4:
               timbase->CCR4 = ccr_duty_cycle;
               break;
      }

    return (0);                         // denote completed OK
}


//*****************************************************************************
//  board_timerpwm_set_period
//
//         Sets the Timer/PWM to use a new period value
//*****************************************************************************
int  board_timerpwm_set_period (unsigned int module_id, long new_period_value, int flags)
{
    TIM_TypeDef         *timbase;
    uint32_t            period_val;
    uint32_t            prescalar_val;

    if (module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

            // get ptr to associated TIM register
    timbase  = (TIM_TypeDef*) _g_timer_module_base [module_id];
    if (timbase == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

    prescalar_val = 0;
    period_val    = new_period_value;

    if (flags & TIMER_AUTO_PRESCALE)
       {       //-------------------------------------------
               //  do any needed Auto Pre-Scaling on new period
               //-------------------------------------------
               // Compute any needed prescaler value to fit 16-bit TIMx counter clock
         prescalar_val = board_timerpwm_compute_prescalar (period_val);
         if (prescalar_val > 0)
            period_val = (period_val / prescalar_val);
         _g_tmpwm_prescalars[module_id] = prescalar_val; // save for duty cycle PRE-SCALAR calcs
       }
      else prescalar_val = _g_tmpwm_prescalars[module_id];  // use any explicitly set pre-scalar

