GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_timers.c
    timbase->ARR = period_val;

    timbase->PSC = prescalar_val;

    return (0);                         // denote completed OK
}



//*****************************************************************************
//  board_timerpwm_set_phase
//
//         Set the PWM's phase between complementary PWM
//         arrangements.
//*****************************************************************************

int  board_timerpwm_set_phase (unsigned int module_id, int chan_num, long phase_offset)
{
#if defined(HAS_TIM8) || defined(HAS_TIM1)
                    // ??? RESEARCH  doesn't TIM1/TIM8 support a poor man's phase shift ?
                    //                   e.g. F3_03 without HRTIM module ?
   return (ERR_PWM_MODULE_NO_PHASE);

#else
   return (ERR_PWM_MODULE_NO_PHASE);    // STM32 F1, F0, L1, L0 do NOT support
                                        // phase shifting.
#endif

}


//*****************************************************************************
//  board_timerpwm_set_prescalar
//
//          Sets the pre-scalar value to use
//          when any Timer rollover or CCR interrupts occur.
//*****************************************************************************
int  board_timerpwm_set_prescalar (unsigned int module_id, long prescalar_val, int flags)
{
    TIM_TypeDef         *timbase;

    if (module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

       //-------------------------------------------------------------------
       // Save the pre-scalar value, then load it into PSC
       //-------------------------------------------------------------------
    _g_tmpwm_prescalars[module_id] = prescalar_val;

            // get ptr to associated TIM register
    timbase  = (TIM_TypeDef*) _g_timer_module_base [module_id];

    timbase->PSC = prescalar_val;      // load it into PSC prescalar reg

    return (0);                        // denote completed OK
}



//******************************************************************************
//                           TIMER / PWM   ISRs
//
//   For those platforms that do not support TIM8/TIM13/TIM14/etc, the linker
//   will automatically discard those routines that are not used.
//   So defining them all here in one place has no negative effect.
//******************************************************************************

void  TIM_Common_IRQHandler(TIM_TypeDef *TIMbase, int tim_index);
void  TIM1_UP_TIM10_IRQHandler(void);  // -- CAUTION SHARED BETWEEN TIM1 and TIM10
void  TIM1_CC_IRQHandler(void);
void  TIM2_IRQHandler(void);
void  TIM3_IRQHandler(void);
void  TIM4_IRQHandler(void);
void  TIM5_IRQHandler(void);
void  TIM6_IRQHandler(void);
void  TIM7_IRQHandler(void);
void  TIM6_DAC_IRQHandler (void);
void  TIM8_CC_IRQHandler (void);
void  TIM1_BRK_TIM9_IRQHandler(void);
void  TIM1_BRK_TIM10_IRQHandler(void);
void  TIM1_TRG_COM_TIM11_IRQHandler(void);
void  TIM8_BRK_TIM12_IRQHandler(void);
void  TIM8_UP_TIM13_IRQHandler(void);  // -- CAUTION SHARED BETWEEN TIM8 and TIM13
void  TIM8_TRG_COM_TIM14_IRQHandler(void);
void  TIM12_IRQHandler (void);
void  TIM13_IRQHandler (void);
void  TIM14_IRQHandler (void);
void  TIM15_IRQHandler (void);
void  TIM16_IRQHandler (void);
void  TIM17_IRQHandler (void);
void  TIM20_IRQHandler (void);
void  TIM21_IRQHandler (void);
void  TIM22_IRQHandler (void);


//******************************************************************************
// TIM_Common_IRQHandler
//
//         To minimize redundant logic in each IRQ handler, we just route every
//         Timer IRQ to here, passing in the relevant parms (TIMx base, ...).
//
//         Note: on ST processors, unused interrupt flags may be set on
//               even though we are not using them, or the app is ignoring them
//               for callbacks. So we have to first filter what interrupts we
//               are going to look at based on User App's interrupt_flag
//               settings on timer_Enable() and timer_Enable_CCR_Output(),
//               and ignore the rest.
//******************************************************************************
volatile uint16_t      temp_hack_SR;
volatile uint16_t      app_rupts_mask2;

void  TIM_Common_IRQHandler (TIM_TypeDef *TIMbase, int tim_index)
{
    register uint16_t  app_rupts_mask;
    int                interrupt_type;
    TIM_HandleTypeDef  *timHandle;

       //--------------------------------------------------------------
       // get a local copy of what interrupts the User App wants
       // to be called back on. In optimized compilers, this should
       // get loaded into a local register.
       //--------------------------------------------------------------
  app_rupts_mask  = _g_timer_app_enabled_interrupts [tim_index];
app_rupts_mask2   = app_rupts_mask;
temp_hack_SR = (uint16_t) TIMbase->SR;
    app_rupts_mask &= (uint16_t) TIMbase->SR; // Mask the app specified interrupts
                                        // against interrupt status register SR.
                                        // The result is those interrupts the
                                        // app is interested in/configed for

       // Handle timing window, where App requested Timer/PWM Disable, but there
       // were still some interrupts left in the pipe.
    if ((TIMbase->CR1 & TIM_CR1_CEN) == 0)
       {    // Timer/PWM is Disabled. Clear any remaining interrupts
         TIMbase->SR = ~(TIMbase->SR);
         return;                               // then bail out
       }

    if (app_rupts_mask == 0)
       {   // we got an interrupt, but have no active config/setup for that CCR.
           // Must have been a private deal/setup by user app, or timing window.
           // Call HAL Library to handle it, and possibly invoke user callback.
        timHandle = (TIM_HandleTypeDef*) _g_timer_runtime_TIM_handle [tim_index];
        if (timHandle != 0L)
           HAL_TIM_IRQHandler (timHandle);    // Have HAL deal with it
           else {     // We got an interrupt but no handler for it.
                      // Just discard it, otherwise we get int a looping
                      // "Hot I/O" interrupt scenario.
                  TIMbase->SR = ~(TIMbase->SR);         // discard the interrupt
                }
        return;                               // then bail out
       }

