GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_timers.c
       //---------------------------------------------------------------------
       // We sequentially walk down each key interrupt type, so that if
       // multiple interrupts are signalled at the same time, we handle them.
       //---------------------------------------------------------------------
  if (app_rupts_mask & TIM_SR_UIF)       // is it an update/rollover interrupt ?
     {      //---------------------------------------------------------
            // clear the interrupt, then invoke any optional callback
            //---------------------------------------------------------
       interrupt_type = TIMER_ROLLOVER_INTERRUPT;
       TIMbase->SR    = ~(TIM_IT_UPDATE);            // clear the interrupt flag
       if (_g_ptimer_callback[tim_index] != 0L)
          {             // Invoke user callback for UPDATE / rollover rupt
            (_g_ptimer_callback[tim_index]) (_g_ptimer_callback_parm[tim_index],
                                             interrupt_type);
          }
     }

  if (app_rupts_mask & TIM_SR_CC1IF)                // is it a CCR1  interrupt ?
     {      //---------------------------------------------------------
            // clear the interrupt, then invoke any optional callback
            //---------------------------------------------------------
       interrupt_type = TIMER_CCR1_INTERRUPT;
       TIMbase->SR    = ~(TIM_IT_CC1);               // clear the interrupt flag
       if (_g_ptimer_callback[tim_index] != 0L)
          {             // Invoke user callback for the interrupt
            (_g_ptimer_callback[tim_index]) (_g_ptimer_callback_parm[tim_index],
                                             interrupt_type);
          }
     }

  if (app_rupts_mask & TIM_SR_CC2IF)                // is it a CCR2  interrupt ?
     {      //---------------------------------------------------------
            // clear the interrupt, then invoke any optional callback
            //---------------------------------------------------------
       interrupt_type = TIMER_CCR2_INTERRUPT;
       TIMbase->SR    = ~(TIM_IT_CC2);               // clear the interrupt flag
       if (_g_ptimer_callback[tim_index] != 0L)
          {             // Invoke user callback for the interrupt
            (_g_ptimer_callback[tim_index]) (_g_ptimer_callback_parm[tim_index],
                                             interrupt_type);
          }
     }

  if (app_rupts_mask & TIM_SR_CC3IF)                // is it a CCR3  interrupt ?
     {      //---------------------------------------------------------
            // clear the interrupt, then invoke any optional callback
            //---------------------------------------------------------
       interrupt_type = TIMER_CCR3_INTERRUPT;
       TIMbase->SR    = ~(TIM_IT_CC3);               // clear the interrupt flag
       if (_g_ptimer_callback[tim_index] != 0L)
          {             // Invoke user callback for the interrupt
            (_g_ptimer_callback[tim_index]) (_g_ptimer_callback_parm[tim_index],
                                             interrupt_type);
          }
     }

  if (app_rupts_mask & TIM_SR_CC4IF)               // is it a CCR4  interrupt ?
     {      //---------------------------------------------------------
            // clear the interrupt, then invoke any optional callback
            //---------------------------------------------------------
       interrupt_type = TIMER_CCR4_INTERRUPT;
       TIMbase->SR    = ~(TIM_IT_CC4);               // clear the interrupt flag
       if (_g_ptimer_callback[tim_index] != 0L)
          {             // Invoke user callback for the interrupt
            (_g_ptimer_callback[tim_index]) (_g_ptimer_callback_parm[tim_index],
                                             interrupt_type);
          }
     }
}

#if defined(HAS_TIM10)
void  TIM1_UP_TIM10_IRQHandler (void)      // NVIC IRQn is: TIM1_UP_TIM10_IRQn
{
#if defined(HAS_TIM1)
    if (TIM1->SR & TIM_SR_UIF)
       TIM_Common_IRQHandler (TIM1, 1);     // TIM1
#endif

    if (TIM10->SR & (TIM_SR_UIF | TIM_SR_CC1IF | TIM_SR_CC2IF | TIM_SR_CC3IF | TIM_SR_CC4IF))
       TIM_Common_IRQHandler (TIM10, 10);   // TIM10
}
#endif

#if defined(TIM1)
void  TIM1_CC_IRQHandler(void)              // NVIC IRQn is:    TIM1_CC_IRQn
{
    TIM_Common_IRQHandler (TIM1, 1);        // TIM1
}
#endif


#if defined(TIM2)
void  TIM2_IRQHandler (void)                // NVIC IRQn is:    TIM2_IRQn
{
    TIM_Common_IRQHandler (TIM2, 2);        // TIM2
}
#endif

#if defined(TIM3)




#if defined(USES_L6474)
extern TIM_HandleTypeDef hTimPwm1;
void  EasySpin_StepClockHandler (int device_id);
#endif

#if MAIN_COPY_IN_easy_spin_main_
       // the following is called back by the HAL_TIM_IRQHandler()
void HAL_TIM_PWM_PulseFinishedCallback (TIM_HandleTypeDef *htim)
{

    EasySpin_StepClockHandler (0);   // passes in Device Id

}
#endif

void  TIM3_IRQHandler (void)                // NVIC IRQn is:    TIM3_IRQn
{

tim3_TIM_rupts_seen++;

  #if defined(USES_L6474)
    HAL_TIM_IRQHandler (&hTimPwm1);         // TIM3    09/08/15 TEMP HACK

    EasySpin_StepClockHandler (0);  // passes in Device Id  BRUTE FORCE callback
  #else
    TIM_Common_IRQHandler (TIM2, 3);       // TIM3
  #endif

}
#endif





#if defined(HAS_TIM4)
void  TIM4_IRQHandler(void)                 // NVIC IRQn is:    TIM4_IRQn
{
    TIM_Common_IRQHandler (TIM4, 4);            // TIM4
}
#endif

#if defined(HAS_TIM5)
void  TIM5_IRQHandler (void)                // NVIC IRQn is:    TIM5_IRQn
{
    TIM_Common_IRQHandler (TIM5, 5);        // TIM5
}
#endif

#if defined(HAS_TIM6)
void  TIM6_DAC_IRQHandler (void)            // NVIC IRQn is:    TIM5_IRQn
{
    TIM_Common_IRQHandler (TIM6, 6);        // TIM6
}
#endif

#if defined(HAS_TIM7)
void  TIM7_IRQHandler (void)                // NVIC IRQn is:    TIM5_IRQn
{
    TIM_Common_IRQHandler (TIM7, 7);        // TIM6
}
#endif



// HAVE A WHOLE BUNCH OF VARIATIONS:  TIM8 + TIM11/12/13

#if defined(HAS_TIM8)
void  TIM8_CC_IRQHandler (void)             // NVIC IRQn is:    TIM8_CC_IRQ
{
    TIM_Common_IRQHandler (TIM8, 8);        // TIM8  CCR rupts only
}

//  TIM8_BRK_TIM12_IRQn         = 43,     /*!< TIM8 Break Interrupt and TIM12 global interrupt                   */
//  TIM8_UP_TIM13_IRQn          = 44,     /*!< TIM8 Update Interrupt and TIM13 global interrupt                  */
//  TIM8_TRG_COM_TIM14_IRQn     = 45,     /*!< TIM8 Trigger and Commutation Interrupt and TIM14 global interrupt */
//  TIM8_CC_IRQn                = 46,     /*!< TIM8 Capture Compare Interrupt                                    */
#endif


#if defined(HAS_TIM9)
void  TIM1_BRK_TIM9_IRQHandler (void)     // NVIC IRQn is:    TIM1_BRK_TIM9_IRQn
{
        // We do not support TIM1_BRK rupts, so only TIM9 rupts should show up
    TIM_Common_IRQHandler (TIM9, 9);
}
#endif


#if defined(HAS_TIM10)
void  TIM1_BRK_TIM10_IRQHandler (void)     // NVIC IRQn is:   TIM1_BRK_TIM10_IRQn
{
        // We do not support TIM1_BRK rupts, so only TIM9 rupts should show up
    TIM_Common_IRQHandler (TIM10, 10);
}
#endif

#if defined(HAS_TIM11)
void  TIM1_TRG_COM_TIM11_IRQHandler (void)  // NVIC IRQn is:  TIM1_TRG_COM_TIM11_IRQn
{
        // We do not support TIM1_COM/TRIGGER rupts, so only TIM11 rupts should show up
    TIM_Common_IRQHandler (TIM11, 11);
}
#endif

#if defined(HAS_TIM12)
void  TIM12_IRQHandler (void)          // NVIC IRQn is:    TIM12_IRQn
{
    TIM_Common_IRQHandler (TIM12, 12);
}
#endif

#if defined(HAS_TIM13)
void  TIM13_IRQHandler (void)          // NVIC IRQn is:    TIM13_IRQn
{
    TIM_Common_IRQHandler (TIM13, 13);
}
#endif

#if defined(HAS_TIM14)
void  TIM14_IRQHandler (void)          // NVIC IRQn is:    TIM14_IRQn
{
    TIM_Common_IRQHandler (TIM14, 14);
}
#endif

#if defined(HAS_TIM15)
void  TIM15_IRQHandler (void)          // NVIC IRQn is:    TIM15_IRQn
{
    TIM_Common_IRQHandler (TIM15, 15);
}
#endif

#if defined(HAS_TIM16)
void  TIM16_IRQHandler (void)          // NVIC IRQn is:    TIM16_IRQn
{
    TIM_Common_IRQHandler (TIM16, 16);
}
#endif

#if defined(HAS_TIM17)
void  TIM17_IRQHandler (void)          // NVIC IRQn is:    TIM17_IRQn
{
    TIM_Common_IRQHandler (TIM17, 17);
}
#endif

#if defined(HAS_TIM20)
void  TIM20_IRQHandler (void)          // NVIC IRQn is:    TIM20_IRQn
{
    TIM_Common_IRQHandler (TIM20, 20);
}
#endif

#if defined(HAS_TIM21)
void  TIM21_IRQHandler (void)          // NVIC IRQn is:    TIM21_IRQn
{
    TIM_Common_IRQHandler (TIM21, 21);
}
#endif

#if defined(HAS_TIM22)
void  TIM22_IRQHandler (void)          // NVIC IRQn is:    TIM22_IRQn
{
    TIM_Common_IRQHandler (TIM22, 20);
}
#endif

/******************************************************************************/
